// mapping.js - The Database
const MAPPING_DATA = {
    "Aa": "आ", "A": "अ", "[": "इ", "{": "ई", "]": "उ", "}": "ऊ",
    "0e": "ऐ", "0": "ए", "1": "ऋ", "1<": "ऋृ", "l<": "ॡ", "†": "ओ",
    "ˆ": "औ", "Š": "अं", "A:": "अः", "Aaš": "ऑ", "k": "क", "q": "ख",
    "g": "ग", "6": "घ", "ƒ": "ङ", "c": "च", "7": "छ", "j": "ज",
    "z": "झ", "‘": "ञ", "3": "ट", "#": "ठ", "D": "ड", "!": "ढ",
    "`": "ण", "t": "त", "4": "थ", "d": "द", "2": "ध", "n": "न",
    "n_": "ऩ", "p": "प", "f": "फ", "b": "ब", "w": "भ", "m": "म",
    "y": "य", "r": "र", "r_": "ऱ", "l": "ल", "v": "व", "x": "श",
    "8": "ष", "s": "स", "h": "ह", ";": "ळ", ";_": "ऴ", "k;": "क्ष",
    "dny": "ज्ञ", "a": "ा", "i": "ि", "I": "ी", "u": "ु", "U": "ू",
    "e": "े", "E": "ै", "o": "ो", "O": "ौ", "M": "ं", ":": "ः",
    "š": "ॅ", "aš": "ॉ", "&": "्", "R": "र्",
    
    // Greedy Patterns (जोडाक्षरे आणि रफार)
    "kaR": "र्का", "qaR": "र्खा", "gaR": "र्गा", "6aR": "र्घा", "caR": "र्चा",
    "jaR": "र्जा", "taR": "र्ता", "daR": "र्दा", "paR": "र्पा", "maR": "र्मा",
    "yaR": "र्या", "vaR": "र्वा", "haR": "र्हा", "dnyaR": "र्ज्ञा"
};

// सर्वात मोठी की मोजणे
let maxKeyLen = 0;
for(let key in MAPPING_DATA) {
    if(key.length > maxKeyLen) maxKeyLen = key.length;
}

self.mappingData = MAPPING_DATA;
self.maxKeyLen = maxKeyLen;
